test/movement.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://www.businessobjects.com/DataServices/ServerX.xsd" xmlns:inp="http://businessobjects.com/service/SRV_IDOC_PREQ/input"><soapenv:Header>
    <ser:session>
       <SessionID>A252106D-D763-4E86-952E-90BA06C7CD31EFB6B5CF06CED8177B4152EFB2B3D5C4</SessionID>
    </ser:session>
 </soapenv:Header>
 <soapenv:Body>
    <inp:PREQCR02>
       <!--Zero or more repetitions:-->
       <inp:EDI_DC40>
       </inp:EDI_DC40>
       <!--1 to 999999999 repetitions:-->
       <inp:E1BPEBANC>
    <inp:DOC_TYPE>NB</inp:DOC_TYPE>
    <inp:MATERIAL>1000174-M</inp:MATERIAL>
    <inp:PLANT>ZIM1</inp:PLANT>
    <inp:STORE_LOC>002A</inp:STORE_LOC>
    <inp:TRACKINGNO>900021</inp:TRACKINGNO>
    <inp:QUANTITY>6</inp:QUANTITY>
    <inp:UNIT>PZ</inp:UNIT>
    <inp:DELIV_DATE>20220921</inp:DELIV_DATE>
       </inp:E1BPEBANC>
    </inp:PREQCR02>
 </soapenv:Body>
</soapenv:Envelope>